<template>
    <div class="contract-wrap" >
        <div class="header">
            <span class="back" onClick="javascript:history.back(-1);"></span>
            <div class="title">
                <ul class="tabs">
                    <!--<span class="line"></span>-->
                    <li class="li-tab" v-for="(item,index) in tabsParam" @click="toggleTabs(index)" :class="{active:index==nowIndex}">{{item}}</li>
                    <!-- <span>|</span> -->
                    <span class="line"></span>

                </ul>
                
            </div>
        </div>

        <div class="confirmOrder-con" :class="{'iphoneTop':isI}" v-show="nowIndex == 0">
            <ul>
                <li class="contract-line">
                    <h2>自由行代订服务合同</h2>
                    <h4>(境内)</h4>
                    <ul class="txt">
                        <li class="partya">甲方：（委托人）__________________________</li>
                        <li class="partyb">
                            <p>乙方：（旅行社）__________________________</p>
                            <p>经营许可证编号：__________________________</p>
                            <p>经营范围：_________________________________</p> 
                        </li>
                        <li>委托人阅读本合同条款及有关附件后未提出异议的，旅行社视为委托人已全部接受，且双方于网上已签订电子合同，该电子合同具有和书面合同同等的法律效力，委托人成功提交产品订单的视为合同成立。</li>
                        <li>根据《中华人民共和国合同法》及有关法律法规的规定，甲乙双方在平等、自愿、协商一致的基础上，就下列委托事项达成如下协议：</li>
                    </ul>
                </li>
                <li class="contract-line">
                    <h2>第一条  词语定义</h2>
                    <p>1.委托人投保的个人旅游保险，指委托人自己购买或者通过旅行社、航空机票代理点、景区等保险代理机构购买的以旅行期间自身的生命、身体、财产或者有关利益为保险标的的短期保险，包括但不限于航空意外险、旅游意外险、紧急救援保险、特殊项目意外险。<br>2.业务损失费，指旅行社因委托人行前解除合同而产生的经济损失。包括乘坐飞机（车、船）等交通工具的费用（含预订金）、饭店住宿费用（含预订金）、旅游观光汽车的人均车租等已发生的实际费用。<br>3.自由行旅游产品，以“交通＋酒店＋个性化可选服务”为核心，在旅行社提供的范围内，委托人可自由选择往返时间、交通、酒店及其他可选配的附加服务，无导游随行，由委托人自行安排行程的旅游产品。<br>4.自由组合航班旅游产品，指去程和回程的航班可以在旅行社所提供的全部航班中任意搭配选择，由于使用旅行社提供的特别组合航班，一经变更或取消会产生实际损失。<br>5.节假日，包括但不限于，春节，国庆节，劳动节，元旦等法定节假日或其它国家性或者地方性的重大节日期间如圣诞节等，节假日的具体时段以国家颁布的为准。凡委托人预订的产品部分或全部涉及节假日的，都属于节假日产品。</p>
                </li>
                <li class="contract-line">
                    <h2>第二条  委托范围</h2>
                    <p>甲方委托乙方办理以下一项或几项服务，旅行社按委托人选择的组合内容代为预订，并接受委托人以总价支付：代订机票、酒店；代办目的地地面资源（例如用车、门票、N日游等）；抵离接送机等。</p>
                </li>
                <li class="contract-line">
                    <h2>第三条  委托项目和费用</h2>
                    <p>1.代订项目和费用：详见产品确认单</p>
                    <p>2.航空公司燃油涨价或是临时调价而导致的航线价格上涨，对于已成功付款或在第二天中午12点前付款的订单，不再向委托人收取涨价费用；对于还未付款的订单，委托人同意按照涨价后的价格进行支付。</p>
                    <p>3.产品预订成功后，委托人在规定时间内付清应付代订服务费用，委托人同意接受并经旅行社最终确认后视为合同生效。</p>
                    <p>4.委托人未在规定时间内付清应付费用，产品的价格、内容可能发生变化，委托人仍继续付款的，应以变更后的产品为准。</p> 
                </li>
                <li class="contract-line">
                    <h2>第四条  甲方权利和义务</h2>
                    <p>1.甲方应自觉遵守旅游文明行为规范，尊重目的地的风俗习惯、文化传统和宗教禁忌，爱护旅游资源，保护生态环境。</p>
                    <p>2.甲方应特别注意目的地的法律法规及风俗禁忌，慎重选择骑马、攀岩、滑翔、漂流、潜水、游泳、跳伞、热气球、蹦极等高风险或带有危险性的产品；</p>
                    <p>3.甲方应在自己能够控制风险的范围内选择活动项目，并对自己的安全负责；</p>
                    <p>4.甲方应当确保所提供的证件、资料及联系电话真实有效；</p>
                    <p>5.甲方应按约定向乙方全额支付所有代订项目的服务总费用；</p>
                    <p>6.甲方应自行保管好随身携带的财物；</p>
                    <p>7.发生意外事件或纠纷时，甲方应本着平等协商的原则解决，采取适当措施防止损失扩大，否则应当就扩大的损失承担责任；</p>
                    <p>8.在合法权益受到损害要求协助索赔时，甲方应提供合法有效的凭据；</p>
                    <p class="txtcolor">9.节假日产品，鉴于资源的特殊状况，甲方未经乙方同意不得取消或更改； </p>
                    <p class="txtcolor">10.甲方因自身原因致使人身、财产权益受到损害的，乙方不承担赔偿责任，若因此造成乙方损失的，还应对乙方承担赔偿责任。</p> 
                </li>
                <li class="contract-line">
                    <h2>第五条  乙方权利和义务</h2>
                    <p>1.乙方有权根据委托人的身体健康状况及相关条件决定是否接纳报名；</p>
                    <p>2.乙方有权拒绝委托人提出的超出合同约定的不合理要求；</p>
                    <p>3.乙方应告知委托人抵达目的地的具体接洽事宜；</p>
                    <p>4.乙方按照约定的内容和标准为委托人提供服务；</p>
                </li>
                <li class="contract-line">
                    <h2>第六条  违约责任</h2>
                        <p class="txtcolor responsibility">1.甲方违约责任</p>
                        <p class="txtcolor describe">甲方在出发前提出解除合同的，如预订产品时已对业务损失费用做过特别约定的，可以从其约定；如未做约定的，应当按下列标准向乙方支付业务损失费，下述时间的计算不包括双休日及法定节假日：</p>
                        <p class="txtcolor">（1）出发前72小时（不含第72小时），按旅游费用总额20%；</p>
                        <p class="txtcolor">（2）出发前72小时至24小时，按旅游费用总额80%；</p>
                        <p class="txtcolor describe">（3）出发前24小时以内（不含第24小时），按旅游费用总额100%；</p>
                        <p class="txtcolor describ">如甲方预订的是自由组合航班的旅游产品，航班部分甲方应当按实际损失对乙方予以赔偿，除航班以外部分按照业务损失费收取，具体业务损失费以第六条第1点为准。 <br> 如甲方预订的是景加酒旅游产品，甲方不可要求单独退订酒店。 <br>多项代订项目中的一项，鉴于资源的特殊性，若更改或取消时，会产生额外损失，此类特定资源的退变更条款以产品中的“预订限制”为准。 </p>
                        <p class="txtcolor responsibility">2.乙方违约责任</p>
                        <p class="txtcolor describe">乙方在出发前提出解除合同的，向甲方全额退还旅游费用，并赔偿甲方损失费用。如预订产品时已对损失费用做过特别约定的，可以从其约定；如未做约定的，按下列标准向甲方赔偿损失费用，下述时间的计算不包括双休日及法定节假日：</p>
                        <p class="txtcolor">（1）出发前72小时（不含第72小时），按旅游费用总额20%；</p>
                        <p class="txtcolor">（2）出发前72小时至24小时，按旅游费用总额80%；</p>
                        <p class="txtcolor">（3）出发前24小时以内（不含第24小时），按旅游费用总额100%；</p>
                </li>
                <li class="contract-line">
                    <h2>第七条  合同的变更</h2>
                    <p>1.合同生效后，甲方要求更改的，应选择同一出发地和目的地并仍在可售卖日期内的产品，或经乙方同意，甲方可以将其在合同中的权利和义务转让给符合出游条件的第三人。但甲方应向旅行社支付由此增加的服务费用以及给乙方造成的损失也由甲方承担。由此减少的服务费用，乙方应当退还甲方。<br> 2.合同生效后，因乙方原因引起的更改，由此增加的服务费用由乙方承担，由此减少的服务费用，乙方应当退还旅游者。</p>
                </li>
                <li class="contract-line">
                    <h2>第八条  不可抗力和意外事件</h2>
                    <p>不可抗力，指不能预见、不能避免并不能克服的客观情况，包括但不限于因自然原因和社会原因引起的，如自然灾害、战争、恐怖活动、动乱、骚乱、罢工、突发公共卫生事件、政府行为、黑客攻击、电信部门技术管制。<br>
                        意外事件，指因当事人故意或者过失以外的偶然因素引发的事件，包括但不限于重大礼宾活动导致的交通堵塞、列车航班晚点、景点临时不开放。<br>
                        因不可抗力或者意外事件导致无法履行或者继续履行合同的，双方均可以解除合同，合同解除后，乙方退还甲方未实际发生的费用后不再承担其他任何责任；双方同意变更合同的，因此增加的费用由甲方承担，减少的费用乙方退还甲方。<br>
                    </p>
                </li>
                <li class="contract-line">
                    <h2>第九条  第三方责任</h2>
                    <p>由于航空公司、保险公司、及其他有权机构等不可归责于乙方的原因导致委托人人身、财产权益受到损害的，包括但不限于，航班延误或取消等，应由甲方自行协商解决，乙方除在力所能及的范围内予以协助外，不再承担其他责任，如给乙方造成损失的，乙方保留一切追偿权。</p>
                </li>
                <li class="contract-line">
                    <h2>第十条  争议解决</h2>
                    <p class="txtcolor">本合同履行过程中发生争议，由双方协商解决，协商不成的，任何一方有权依法向上海市长宁区人民法院起诉。 </p>
                </li>
                <li class="contract-line">
                    <h2>第十一条  特别提示</h2>
                    <p>1.旅客信息，委托人应最晚在离出发时间72小时之前向旅行社提供正确的旅客信息，包括证件类型、证件号码、证件有效期、出生日期、性别、国籍等，并应保证上述信息的真实性。<br>
                        2.婴儿，旅游者携带婴儿出行的，需自行购买婴儿机票及办理婴儿签证等，如旅行社可以协助的，需额外收取该部分费用。<br>
                        3.酒店入住，通常酒店对入住客人会有年龄的要求，例如，同订单中至少要有一位入住客人已满十八周岁。实际入住和离店时间以入住的酒店为准，如客人提前入住或推迟离店，均须酌情加收一定的费用。<br>
                        4.付款，为保证产品的成功预订，委托人应在产品确认后24小时之内付款。如委托人未按要求及时付清相关费用，而此时旅行社预留的产品的价格、内容或标准等发生变化，旅行社对此将不承担任何责任。</p>
                        <p class="txtcolor"> 5.明折明扣机票。由于您选择了明折明扣机票，因网上数据更新有一定的延时，您所选定的航班、舱位和价格我们会根据民航订座系统的订位数据订位并最晚在订单最晚回复时间前由操作人员给您回复确认。</p> 
                        <p>6.委托人年龄，委托人系18周岁以下（不包括18周岁）或 70岁以上（包括70岁）参加旅游,应有亲属同意，非单人出行。</p>
                        <p class="txtcolor"> 7.安全提示，委托人参加高原地区旅游或风险旅游项目（包括但不限于：游泳、浮潜、冲浪、漂流等水上活动以及骑马、攀岩、登山等高风险的活动）或患有不宜出行旅游的病情（包括但 不限于：恶性肿瘤、心血管病、高血压、呼吸系统疾病、癫痫、怀孕、精神疾病、身体残疾、糖尿病、传染性疾病、慢性疾病健康受损），须在报名前自行前往医疗机构体检后，确保自身身体条件能够完成本次旅游活动，并向旅行社提供体检报告副本；委托人须保证提供的身体健康状况真实，如隐瞒由本人承担全部责任；委托人系 70岁以上（含70岁）参加旅游，应有亲属同意，且非单人出行，同时在出行前如实填写并提交《身体健康申报表》；旅行社已经给予委托人出游安全提示（旅行社已经提示并劝阻，但如委托人仍坚持参加旅游活动，由此造成任何人身意外及不良后果将由委托人本人全部承担）。</p>
                </li>
                <li class="contract-line">
                    <h2>第十二条</h2>
                    <p class="txtcolor">本协议已对与旅游者权益有或可能有重大关系的条款用粗体字标注提示旅游者注意，请旅游者仔细阅读。一经旅游者确认，则视为您实际使用本服务前，您已充分阅读理解并接受本合同的全部内容。 </p>
                </li>
                <li class="contract-line">
                    <h2>第十三条  旅行社经营资质</h2>
                    <p>上海爱为途歌旅行社有限公司</p>
                    <p>企业类型：有限责任公司</p>
                    <p>国际旅行社业务许可证编号：L-SH-01911</p>
                    <p>经营范围：境内旅游、入境旅游业务。</p>
                    <p>法定代表人：朱卫东</p>
                    <p>上海市旅游局质量监督所电话：962020</p>
                </li>
            </ul>
        </div>
        <div class="confirmOrder-con" :class="{'iphoneTop':isI}" v-show="nowIndex == 1">
            <ul>
                <li class="contract-line">
                    <h2>境内旅游合同（2013版）</h2>
                    <h3>使用说明</h3>
                    <p> 一、本合同为示范文本，供旅游者参加境内旅游（不含赴港、澳、台地区旅游及边境游）与旅行社签订团队境内旅游合同时使用。旅游者应选择具有合法经营旅游业务资格的旅行社。旅行社应具有旅游行政管理部门颁发的《旅行社业务经营许可证》和工商行政管理部门颁发的《营业执照》。<br>
                    二、旅游前，旅行社应当与旅游者签订书面旅游合同，旅游者在交纳费用后，旅行社应开具发票。<br>
                    三、旅游者应结合自身身体状况选择旅游产品及项目。<br>
                    四、旅行社委托组团、拼团的，须事先告知旅游者并在本合同中载明。拼团，指旅行社在保证所承诺的服务内容和标准不变的前提下，在签订合同时经旅游者同意，与其他旅行社招徕的旅游者拼成一个团统一安排旅游服务的行为。<br>
                    五、旅游者与旅行社通过互联网在线旅游网站签订合同的可使用本合同电子版。<br>
                    六、在填写本合同第二条“行程与标准”和“旅游行程单”时，旅行社应以准确、明晰的语言表述，不得出现“准X星级”、“相当于X星级”、“豪华”、“仅供参考”、“与××同级”等模糊不确定性用语。<br>
                    七、旅游者有权自主选择旅游产品和服务，有权拒绝旅行社的强制交易行为。<br>
                    八、旅行社在签订合同时应注明该旅游项目所包含的景点门票及住宿、餐饮、交通标准、导游服务等相关内容。<br>
                    九、旅行社制定补充条款对本合同示范文本有关条款的内容进行补充、细化的，补充条款的内容不得减轻或者免除应当由旅行社承担的责任。<br>
                    十、本合同示范文本是《上海市国内旅游合同示范文本（2009版）》修改版本，自本版本下发之日起使用，今后凡未制定新的版本前，本版本延续使用。<br>
                    十一、旅游咨询与投诉机构：<br>
                    1．上海市旅游质量监督所<br>
                    地　　址：中山西路2525号<br>
                    邮　　编：200030<br>
                    投诉电话：962020<br>
                    2．上海市消费者申（投）诉举报中心<br>
                    举报投诉电话：12315<br>
                    3．上海市文化市场行政执法总队<br>
                    地　　址：永嘉路383号<br>
                    邮　　编：200040<br>
                    旅游违法违规举报电话：12318</p>
                </li>
                <li class="contract-line">
                    <h3>合同编号：____________</h3>
                    <h2>境内旅游合同（2013版）</h2>
                    <ul class="txt">
                        <li class="partya">
                            <p>甲方（旅游者或旅游团体）：____________________</p> 
                            <p>详见旅游产品确认单____________________________</p>
                        </li>
                        <li class="partyb">
                            <p>乙方：（旅行社）_________见下_________________</p>
                            <p>经营许可证编号：_________见下_________________</p>
                            <p>经营范围：___________见下_____________________</p> 
                        </li>
                        <li>为保证旅游服务质量，明确合同当事人的权利义务，根据《中华人民共和国合同法》、《中华人民共和国旅游法》、《旅行社条例》等有关法律法规的规定，双方经过协商一致，达成如下协议：</li>
                    </ul>
                </li>
                <li class="contract-line">
                    <h2>第一条 合同标的（详见旅游产品确认单及行程单）</h2>
                    <p>旅游产品名称</p>
                    <p>团　　号__________________________________</p>
                    <p>组团方式（三选一）</p>
                    <p>□ 自行组团</p>
                    <p>□ 委托组团（委托社全称____________________________）</p>
                    <p>□ 拼团（其他社全称________________________________）</p>
                    <p>出发日期_______________，出发地点__________________</p>
                    <p>途经地点（经停地点）_______________________________</p>
                    <p>目的地_____________________________________________</p>
                    <p>结束日期_______________，返回地点__________________。</p>
                </li>
                <li class="contract-line">
                    <h2>第二条 行程与标准（乙方提供旅游行程单，须含下列要素）</h2>
                    <h3 class="list">（详见旅游产品确认单及行程单)</h3>
                    <p>景点名称和游览时间___________________________________</p>
                    <p>往返交通___________________，标准____________________</p>
                    <p>游览交通___________________，标准____________________</p>
                    <p>旅游者自由活动时间______________，次数_______________</p>
                    <p>住宿安排（名称）及标准和住宿天数_____________________
                        _______________________________________________。
                    </p>
                    <p>用餐次数___________________，标准____________________</p>
                    <p>地接社名称_________________，地址____________________</p>
                    <p>地接社联系人_______________，联系电话________________</p>
                    <p>导游服务（□全陪；	&nbsp;□地陪）</p>
                </li>
                <li class="contract-line">
                    <h2>第三条 旅游者保险（详见旅游产品确认单及行程单）</h2>
                    <p>乙方提示甲方购买旅游意外险。经乙方推荐，甲方 （应填同意或不同意，打勾无效）委托乙方办理个人投保的旅游意外保险。</p>
                    <p>保险公司及产品名称：_____________________________。</p>
                    <p>保险金额：____________元，保险费：_____________元。</p>
                </li>
                <li class="contract-line">
                    <h2>第四条 旅游费用及其支付（详见旅游产品确认单及行程单）</h2>
                    <p>甲方应交纳旅游费用 元，大写 元。（含导游服务费用_______ 元/人，合计_______元）。</p>
                    <p>旅游费用交纳期限_________________________。</p>
                    <p>旅游费用交纳方式 □ 现金；□ 支票；□ 信用卡；</p>
                    <p>□ 其他___________________。</p>
                </li>
                <li class="contract-line">
                    <h2>第五条 双方的权利义务</h2>
                    <h4>(一）甲方的权利与义务</h4>
                    <p class="">
                        1．甲方应自觉遵守旅游文明行为规范，尊重旅游目的地的风俗习惯、文化传统和宗教禁忌，爱护旅游资源，保护生态环境。甲方在旅游活动中应遵守《中国公民国内旅游文明行为公约》和安全警示规定，遵守团队纪律，配合乙方完成合同约定的旅游行程。<br>
                        2．甲方有权知悉其购买的旅游产品和服务的真实情况，有权要求乙方按照约定提供产品和服务，拒绝乙方未经协商一致指定具体购物场所，安排另行付费旅游项目的行为。<br>
                        3．甲方有权拒绝乙方未经事先协商一致的转团、拼团行为。<br>
                        4．在旅游过程中，甲方应自行保管好随身携带的财物。<br>
                        5．在自行安排活动期间，甲方应在自己能够控制风险的范围内活动，选择自己能够控制风险的活动项目，并对自己的安全负责。<br>
                        6．行程中发生纠纷，甲方应与乙方平等协商解决，不得损害乙方的合法权益，不得以拒绝上、下机（车、船）等行为拖延行程或者脱团，否则应当就扩大的损失承担赔偿责任。<br>
                        7．甲方在签订合同或者填写各种材料时，应当使用有效身份证件，并对填写信息的真实性、有效性负责。限制民事行为能力人单独出行的，须由监护人书面同意。<br>
                        8．甲方购买旅游产品、接受旅游服务时，应当如实告知与旅游活动相关的个人健康信息，参加适合自身条件的旅游活动，遵守旅游活动中的安全警示要求，配合有关部门、机构或乙方采取的安全防范和应急处理措施。<br>
                        9．甲方不能成行的，可以让具备参加本次旅游条件的第三人代为履行合同，并及时通知乙方。因代为履行合同增加或减少的费用，双方应按实结算。</p>
                    <h4 class="txta">(二）乙方的权利与义务</h4>
                    <p>
                        1．乙方不得以不合理的低价组织旅游活动，诱骗旅游者，并通过安排购物或者另行付费旅游项目获取回扣等不正当利益。<br>
                        2．乙方提供旅游行程单应与本合同团号一致，经双方签字或者盖章确认后作为本合同的组成部分。<br>
                        3．乙方应在出团前，如实告知相关旅游服务项目和标准，提醒甲方遵守旅游文明行为规范，尊重旅游目的地的风俗习惯、文化传统、宗教禁忌。在合同订立时及履行中，乙方应对旅游中可能危及甲方人身、财产安全的情况，作出真实说明和明确警示，并采取防止危害发生的适当措施（可另附安全告知书，由甲方确认签字）。<br>
                        4．甲方属老年人等特殊群体凭有效证件可享受旅游景点门票优惠的，双方对该旅游景点门票价格可在补充条款中另行约定。<br>
                        5．因航空、轮船、铁路运输等费用遇政策性调价导致合同总价发生变更的，双方应按实结算。<br>
                        6．乙方按照合同约定，为旅游团队委派的导游人员，应持有国家规定的导游证。<br>
                        7．甲方有下列情形之一的，乙方可以解除合同：<br>
                        （1）患有传染病等疾病，可能危害其他旅游者健康和安全的；<br>
                        （2）携带危害公共安全的物品且不同意交有关部门处理的；<br>
                        （3）从事违法或者违反社会公德的活动的；<br>
                        （4）从事严重影响其他旅游者权益的活动，且不听劝阻、不能制止的；<br>
                        （5）法律规定的其他情形。<br>
                        因前款情形解除合同的，乙方应当按本合同第六条扣除必要的费用后，将余款退还甲方；给乙方造成损失的，甲方应当依法承担赔偿责任。<br>
                        8．成团人数与不成团的约定（二选一）<br>
                        □ 最低成团人数__详见旅游产品确认单及行程单__人；低于此人数不能成团时，乙方应当提前7日通知甲方，本合同解除，向甲方退还已收取的全部费用。<br>
                        □ 本团成团不受最低人数限制。
                    </p>
                </li>

                <li class="contract-line">
                    <h2>第六条 甲方解除合同及承担必要费用</h2>
                    <p>因甲方自身原因导致合同解除，乙方按下列标准扣除必要费用后，将余款退还甲方（二选一）</p>
                    <h5>（一）双方可以进行约定并从其约定：</h5>
                    <p>
                        1．在行程前解除合同的，必要的费用扣除标准为：<br>
                        （1）行程前______日至______日，旅游费用 ％；<br>
                        （2）行程前______日至______日，旅游费用 ％；<br>
                        （3）行程开始当日，旅游费用____________  ％。
                        甲方行程前逾期支付旅游费用超过___1___日的，或者甲方未按约定时间到达约定集合出发地点，也未能在中途加入旅游团队的，乙方可以视为甲方解除合同，乙方可以按本款约定扣除必要的费用后，将余款退还甲方。<br>
                        2．在行程中解除合同的，必要的费用扣除标准为：<br>
                        旅游费用-（机、车、船票费用）-（酒店费用）-（景点门票费用）-（其他必要费用）
                    </p>
                    <h5>(二）双方没有约定的，按照下列标准扣除必要的费用。</h5>
                    <p>
                        1．在行程前解除合同的，机（车、船）票费用按实结算后，其余必要的费用扣除标准为：<br>
                        （1）行程前7日至4日，旅游费用10％；<br>
                        （2）行程前3日至1日，旅游费用20％；<br>
                        （3）行程开始当日，旅游费用30％。<br>
                        甲方行程前逾期支付旅游费用超过__1__日的，或者甲方未按约定时间到达约定集合出发地点，也未能在中途加入旅游团队的，乙方可以视为甲方解除合同，乙方可以按本款规定扣除必要的费用后，将余款退还甲方。<br>
                        2．在行程中解除合同的，必要的费用扣除标准为：<br>
                        （旅游费用-旅游费用×行程开始当日扣除比例）÷旅游天数×已经出游的天数+旅游费用×行程开始当日扣除比例。<br>
                        如按上述1、2方式支付的必要的费用低于实际发生的费用，按照实际发生的费用扣除，但最高额不应超过旅游费用总额。<br>
                        行程前解除合同的，乙方扣除必要的费用后，应当在合同解除之日起__30__个工作日内向甲方退还剩余旅游费用；<br>
                        行程中解除合同的，乙方扣除必要的费用后，应当在协助甲方返回出发地或者到达甲方指定的合理地点后 30 个工作日内向甲方退还剩余旅游费用。
                    </p>
                </li>
                <li class="contract-line">
                    <h2>第七条 违约责任</h2>
                    <p>
                    （一）乙方在行程前7日以内（不含第7日，下同）提出解除合同的，向甲方退还全额旅游费用，并按下列标准向甲方支付违约金（二选一）<br>
                    1．双方可以进行约定并从其约定。<br>
                    （1）行程前______日至______日，支付旅游费用总额 ％的违约金；<br>
                    （2）行程前______日至______日，支付旅游费用总额 ％的违约金；<br>
                    （3）行程开始当日，支付旅游费用总额______％的违约金。<br>
                    2．双方没有约定的，按照下列标准承担违约责任。<br>
                    （1）行程前7日至4日，支付旅游费用10％的违约金；<br>
                    （2）行程前3日至1日，支付旅游费用总额15％的违约金；<br>
                    （3）行程开始当日，支付旅游费用20％的违约金。<br>
                    如上述违约金不足以赔偿甲方的实际损失，乙方应当按实际损失对甲方予以赔偿。<br>
                    乙方应当在取消出团通知到达日起__>30__个工作日内，向甲方退还全额旅游费用并支付违约金。<br>
                    （二）甲方逾期支付旅游费用的，应当每日按照逾期支付部分旅游费用的 10 ％，向乙方支付违约金。<br>
                    （三）甲方提供的个人信息及相关材料不真实而造成损失，由其自行承担；如给乙方造成损失的，甲方还应当承担赔偿责任。<br>
                    （四）甲方因不听从乙方的劝告、提示而影响团队行程，给乙方造成损失的，应当承担相应的赔偿责任。<br>
                    （五）乙方未按合同约定标准提供交通、住宿、餐饮等服务，或者未经甲方同意调整旅游行程，给甲方造成损失的，责任由乙方承担。<br>
                    （六）乙方未经甲方同意，擅自将旅游者转团、拼团的，甲方在行程前（不含当日）得知的，有权解除合同，乙方全额退还已交旅游费用，并按旅游费用的15％支付违约金；甲方在行程开始当日或者行程开始后得知的，乙方应当按旅游费用的25％支付违约金。如违约金不足以赔偿甲方的实际损失，乙方应当按实际损失对旅游者予以赔偿。<br>
                    （七）乙方未经与甲方协商一致或者未经甲方要求，指定具体购物场所或安排另行付费旅游项目的，甲方有权在旅游行程结束后三十日内，要求乙方为其办理退货并先行垫付退货货款，或者退还另行付费旅游项目的费用。<br>
                    （八）乙方具备履行条件，经甲方要求仍拒绝履行合同，造成甲方人身损害、滞留等严重后果的，甲方除要求乙方承担相应的赔偿责任外，还可以要求乙方支付旅游费用____-____倍（一倍以上三倍以下）的赔偿金。<br>
                     <span style="word-break: break-all;color:#999;">
                         （九）其他违约责任：<br>_____________________________________________________
                    </span>   
                    </p>
                </li>
                <li class="contract-line">
                    <h2>第八条 附则</h2>
                    <p>本合同自双方签字或盖章之日起生效，本合同附有行程单、安全告知书和补充条款均为合同的附件，与本合同具有同等的法律效力。</p>
                </li>

                <li class="contract-line">
                    <h2>补充条款</h2>
                    <p class="txtcolor">
                        1. 由于第三方（例如，航空公司、保险公司、及其他有权机构等）等不可归责于旅行社的原因导致旅游者人身、财产权益受到损害的，包括但不限于，航班延误或取消等，应由旅游者自行协商解决，旅行社除在力所能及的范围内予以协助外，不再承担其他责任，如给旅行社造成损失的，旅行社保留一切追偿权。<br>
                        2. 不可抗力是指不能预见、不能避免并不能克服的客观情况。不可抗力等不可归责于旅行社的客观原因包括但不限于，恶劣天气、自然灾害、战争、罢工、骚乱、恐怖事件、政府行为、公共卫生事件等客观原因，造成旅游行程安排的交通服务延误、景区临时关闭、宾馆饭店临时被征用、我国政府机构发布橙色及以上旅游预警信息等，均会导致旅游目的无法实现，旅行社不承担违约责任。<br>
                        3. 因不可抗力或者旅行社、履行辅助人已尽合理注意义务仍不能避免的事件，影响旅游行程的，双方达成变更意思一致的，因此增加的费用由旅游者承担，减少的费用退还旅游者；双方未能达成变更意思一致的，均可解除合同，旅行社应扣除已向地接社或履行辅助人支付且不可退还的费用后，将余款退还旅游者；旅行社采取安全措施保护旅游者人身、财产安全而支出的费用，旅游者应承担比例不少于50%；造成旅游者滞留当地而增加的食宿费用，由旅游者承担，增加的返程费用，旅游者应承担比例不少于50%。<br>
                        4. 如果发生航班延误、航班取消等特殊情况，请及时致电旅行社，已实际发生的费用不予退还。<br>
                        5. 旅游者参加高原地区旅游或风险旅游项目（包括但不限于：游泳、浮潜、冲浪、漂流等水上活动以及骑马、攀岩、登山等高风险的活动）或患有不宜出行旅游的病情（包括但 不限于：恶性肿瘤、心血管病、高血压、呼吸系统疾病、癫痫、怀孕、精神疾病、身体残疾、糖尿病、传染性疾病、慢性疾病健康受损），须在报名前自行前往医疗机构体检后，确保自身身体条件能够完成本次旅游活动，并向旅行社提供体检报告副本；旅游者须保证提供的身体健康状况真实，如隐瞒由本人承担全部责任；旅游者系18周岁以下（含18岁）参加旅游，应至少有一位18周岁以上人员陪同出行；旅游者系 70岁以上（含70岁）参加旅游，应有亲属同意，且非单人出行，同时在出行前如实填写并提交《身体健康申报表》；旅行社已经给予旅游者出游安全提示（旅行社已经提示并劝阻，但如旅游者仍坚持参加旅游活动，由此造成任何人身意外及不良后果将由旅游者本人全部承担）。<br>
                        6. 旅游者在旅游期间和自行安排活动期间应严加注意人身及财产安全。旅游者因自身原因或第三方原因导致的人身、财产损失由旅游者自行承担；由此给旅行社造成损失的，旅游者应当承担赔偿责任。</p>
                    <p> 7. 为了更全面的保障旅游者的人身安全，旅行社建议游客出游时根据个人意愿和需要自行投保个人险种。<br>
                        8. 旅游者务必带好所需物品，准时到达指定地点集合。如迟到半小时以上视为自动放弃行程。<br>
                        9. 旅游者擅自分团、脱团的，旅行社有权反馈至相关行政机构。旅游者不得要求旅行社退还任何费用。如旅行社因此遭受损失的，旅行社有权向旅游者追偿。<br>
                        10. 旅游者经与旅行社协商一致的，可暂时离团，但应与旅行社签署书面协议，旅行社应扣除已向地接社或履行辅助人支付且不可退还的费用后，将余款退还旅游者。</p>
                    <p class="txtcolor">11. 若旅游行程内含有购物店，旅游者有权选择是否参加，如旅游者不愿参加，可选择预订其他旅游产品线路，或届时直接向导游或领队提出，由旅行社和旅游者另行协商安排。旅游行程中的自由活动期间内，旅行社将会视旅游者需求及实际情况推荐部分自费项目，如旅游者自愿参加，应与旅行社另行签署书面协议，并不得影响同团其他客人在此期间的活动安排。<br>
                        12.争议解决方式：本合同履行过程中发生争议，由双方协商解决，亦可在旅游合同结束之日90天内向旅游质监机构申请调解，也可向消费者协会等有关部门或者机构申请调解，也可提请上海杨浦区法院诉讼。</p>
                    <p> 13.《中国公民国内旅游文明行为公约》<br>
                        营造文明、和谐的旅游环境，关系到每位游客的切身利益。做文明游客是我们大家的义务，请遵守以下公约：<br>
                        （1) 维护环境卫生。不随地吐痰和口香糖，不乱扔废弃物，不在禁烟场所吸烟。<br>
                        （2) 遵守公共秩序。不喧哗吵闹，排队遵守秩序，不并行挡道，不在公众场所高声交谈。<br>
                        （3) 保护生态环境。不踩踏绿地，不摘折花木和果实，不追捉、投打、乱喂动物。<br>
                        （4) 保护文物古迹。不在文物古迹上涂刻，不攀爬触摸文物，拍照摄像遵守规定。<br>
                        （5) 爱惜公共设施。不污损客房用品，不损坏公用设施，不贪占小便宜，节约用水用电，用餐不浪费。<br>
                        （6) 尊重别人权利。不强行和外宾合影，不对着别人打喷嚏，不长期占用公共设施，尊重服务人员的劳动，尊重各民族宗教习俗。<br>
                        （7) 讲究以礼待人。衣着整洁得体，不在公共场所袒胸赤膊；礼让老幼病残，礼让女士；不讲粗话。<br>
                        （8) 提倡健康娱乐。抵制封建迷信活动，拒绝黄、赌、毒。<br>
                        14.中国公民出境旅游文明行为指南<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;中国公民，出境旅游，注重礼仪，保持尊严。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;讲究卫生，爱护环境；衣着得体，请勿喧哗。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;尊老爱幼，助人为乐；女士优先，礼貌谦让。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;出行办事，遵守时间；排队有序，不越黄线。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;文明住宿，不损用品；安静用餐，请勿浪费。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;健康娱乐，有益身心；赌博色情，坚决拒绝。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;参观游览，遵守规定；习俗禁忌，切勿冒犯。<br>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;遇有疑难，咨询领馆；文明出行，一路平安。<br>
                    </p>
                        <p>15. 度假产品确认单作为合同附件，是本合同的有效组成部分，与本合同具有同等法律效力。</p>
                        <p class="txtcolor">16. 本协议已对与旅游者权益有或可能有重大关系的条款用粗体字标注提示旅游者注意，请旅游者仔细阅读。一经旅游者确认，则视为您实际使用本服务前，您已充分阅读理解并接受本合同的全部内容。</p> 
                        <p>17. 旅行社经营资质</p>
                        <p>上海爱为途歌旅行社有限公司</p>
                        <p>企业类型：有限责任公司</p>
                        <p>国际旅行社业务许可证编号：L-SH-01911</p>
                        <p>经营范围：境内旅游、入境旅游业务。</p>
                        <p>法定代表人：朱卫东</p>
                </li>
            </ul>
        </div>
    </div>
</template>

<script>
import {C} from "@/common/connect";
import { isWeixin } from "@/common/utils";
export default {
  name: "contract",
  data() {
    return {
      isI: /iphone/i.test(navigator.userAgent),
      tabsParam:['自由行合同','境内旅游合同'],
      nowIndex:0,
      isShow:false,
      screenWidth: document.body.clientWidth, 
      msg: "Welcome to Your Vue.js App SCSS",
      name: "wo shi contract",
      lxl:{
      //  a:""
      }

    };
  },
  created() {
      console.log(C);
      this.nowIndex=this.$route.params.type;
    /*  connect.getApi('rv-travel-business/v1/travelChoiceCarModel/1',{},{}).then(data=>{
          console.log(data);
      });
      connect.getApi('rv-travel-mainpage/v1/featureWords',{},{
          headers: {
              'xxxxx': 'ddddd'
          }
      }).then(data=>{
          //this.featureWords = data.data.resultList;
          console.log(data.data);
          console.log(this.featureWords);
      });*/
  /* getInfo({
      cartkey: '39b813508b44e73a66bfddbb0563f91e',
      demandcartkey: '39b813508b44e73a66bfddbb0563f91e',
      provinceid: 1,
      province: 1,
      provincename: '上海',
      tradername: 'yw_app',
      trader: 'h5',
      closesignature: 'yes',
      signature_method: 'md5',
      timestamp: '1521771333651',
      signature: '****',
      siteid: 0
    }).then(data=>{
      console.log(data)
    })*/
  },
  methods:{
    //   back() {
    //       this.$LS.backView(this, {});
    //   },
      toggleTabs(index){
          console.log(this.$route.params.type)
          this.nowIndex = index;
          window.resize;
      }
        },
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss" scoped>
  .fontxt{
    // font-family: PingFangSC-Medium;
    font-weight: 600;
  }
    .header{
        font-family:"PingFangSC-Regular", "Helvetica Neue", "Roboto", sans-serif;
        position: fixed;
        top: 0;
        left: 0;
        right: 0;
        z-index: 100;
        padding: 0 4%;
        width: 100%;
        height: 48px;
        border-bottom: 1Px solid #f1f1f1;
        background: #fff;
        border-bottom:  1px solid #eee;
        overflow: hidden;
         &.head_i {
             padding-top: 18px;
             height: 64px;
            border-bottom: 1px solid #f1f1f1;
        }
        .back {
        position: relative;
        float: left;
        margin-top: 15px;
        width: 10px;
        height: 18px;
        z-index: 99;
        background: url(../assets/images/back.png);
        background-size: 10px 18px;
        // @include bis('back.png');
        }
        .title {
            width: 100%;
            text-align: center;
            font-size: 16px;
            line-height: 48px;
            color: #333333;
            // @include pfr();
            .tabs{
                width: 100%;
                height: 48px;
                margin: 0 auto;
                position: relative;
                .li-tab{
                    display: inline-block;
                    margin: 0 auto;
                    color: #999999;
                    line-height: 20px; 
                    margin:0 10px; 
                    position: relative;
                }
                .active{
                    color: #333333;
                    height: 20px;
                    // font-family: PingFangSC-Medium;
                    font-weight: 600;
                }
                .active::after{
                    content: '';
                    width: 25px;
                    height: 3px;
                    border-radius: 2px;
                    text-align: center;
                    background: #FFA731;
                    position: absolute;
                    left: 33%;
                    bottom: -15%;
                }
                .line::after{
                    content: "";
                    width: 1px;
                    height: 10px;
                    background: #d8d8d8;
                    position: absolute;
                    left: 50%;
                    top: 40%;
                }
            }
        }
    }
        @media only screen and (device-width: 375px) and (device-height: 812px) and (-webkit-device-pixel-ratio: 3) {
        .header.head_i {
            padding-top: 44px;
            height: 88px;
        }
    }
    .iphoneTop{
        padding-top:64px;
    }
    .confirmOrder-con {
        font-family:"PingFangSC-Regular", "Helvetica Neue", "Roboto", sans-serif;
        padding-top: 48px;

        h2{
            font-size: 22px;
            line-height: 30px;
            padding-bottom: 10px;
            color: #333333;
            // font-family: PingFangSC-Medium;
            font-weight: 600;
        }
        &.iphoneTop{
            padding-top:64px;
        }
        .contract-line{
            padding:15px 15px 20px 15px;
            margin-bottom: 13px;
            background-color: #fff;
            text-align: justify;
                h3{
                font-size:  16px;
                line-height: 20px;
                padding-bottom: 5px;
                }
                .list{
                    padding-bottom: 10px;
                }
                h4{
                font-size:  16px;
                line-height: 20px;
                /*padding-left: 15px;*/
                padding-bottom: 10px;
                }
                .txta{
                    padding-top: 10px;
                }
                h5{
                font-size:  16px;
                line-height: 20px;
                padding:10px 0 10px 0px;
                } 
            }
            p{
                color: #999999;
                font-size: 13px;
                line-height: 20px;
                // font-weight: bold;
            }
            .txtcolor{
                color: #666666;
                // font-family: PingFangSC-Medium;
                font-weight: 600;
            }
            .responsibility{
                font-size: 16px;
                color: #333333;
                line-height: 22px;
                margin-bottom: 10px;
                font-family: PingFangSC-Regular;
            }
            .describe{
                margin-bottom: 10px;
            }
            .describ{
                margin-bottom: 20px;
            }
            .txt li{
                color: #999999;
                // font-weight: bold;
                font-size: 13px;
                line-height: 20px;
                margin-bottom: 10px;
            }
            li:last-child{
                margin-bottom: 0px;
            }
            .partyb{
                margin-top: 10px;
            }
        }
    @media only screen and (device-width: 375px) and (device-height: 812px) and (-webkit-device-pixel-ratio: 3) {
        .confirmOrder-con.iphoneTop {
            padding-top:88px;
        }
        .confirmOrder-con {
            padding-bottom:34px !important;
        }
    }
</style>